Autodesk.Navisworks.Api.SheetInfo
Sheet information. Often used to represent a sheet in a multi-sheet file

Autodesk.Navisworks.Api.SheetInfo.CheckIsConvertedForLoad
Checks whether this sheet has been previously converted and will load quickly if required

Autodesk.Navisworks.Api.SheetInfo.CheckIsConvertedForSearch
Checks whether this sheet has been previously converted and can be searched without loading

Autodesk.Navisworks.Api.SheetInfo.ContainsMatchingItem(Autodesk.Navisworks.Api.ModelItem)
Checks whether this sheet contains matching modelItem.
item: ModelItem to check
Returns: Returns false if this sheet does not contain matching ModelItem or this sheet hasn't been previously converted
Throws System.ArgumentNullException:
item is null.

Autodesk.Navisworks.Api.SheetInfo.CreateUniqueCopy
Return a copy with unique sheet id

Autodesk.Navisworks.Api.SheetInfo.Id
Uniquely identifies a specific sheet within a file
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SheetInfo.IsLoaded
Get whether the sheet has been loaded during the current Navisworks session
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SheetInfo.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.SheetInfo.PropertyCategories
Get the property category collection
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SheetInfo.SheetType
Get type of sheet
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SheetInfo.SourceGuid
Get original Guid that this sheet was created with. Guid may be modified to ensure all sheets have unique Guids. If the same sheet is added to a document twice, each sheet has the same SourceGuid but different Guids.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SheetInfo.Thumbnail
Get the sheet thumbnail file name
Throws System.ObjectDisposedException:
Object has been Disposed